#pragma once


/////////////////////////////////////////////////////////////////////////////////////////
// 
// scene切り替え用の基底クラス
//
/////////////////////////////////////////////////////////////////////////////////////////


class SceneBase
{

protected:

	// 音量のフェードアウトフラグ
	bool m_is_fade_out = false;

public:

	//-----------------------------------メンバ関数-----------------------------------//

	// 初期化
	virtual void Initialize() {}
	// 更新
	// arg... delta_time(前フレームからの経過時間)
	virtual void Update(float delta_time) {}
	// 描画
	// arg... delta_time(前フレームからの経過時間)
	virtual void Draw(float delta_time) {}
	// 破棄
	virtual void Finalize() {}

	//---------------------------------------------------------------------------------//
};