#pragma once
#include "../dxlib_ext/dxlib_ext.h"


/////////////////////////////////////////////////////////////////////////////////////////
// 
// SEクラス（再生と停止）
//
/////////////////////////////////////////////////////////////////////////////////////////


class MusicSE
{

public:

	//-------------------------------------構造体--------------------------------------//

	// csvで読み取ったSE情報
	struct sMusicSE
	{
		int s_id;
		int s_se_hdl = 0;
	};

	//--------------------------------------------------------------------------------//

	
	//--------------------------コンストラクタ、デストラクタ--------------------------//

	MusicSE();

	~MusicSE();

	//-------------------------------------------------------------------------------//
	
private:

	//-----------------------------------メンバ変数----------------------------------//

	// SE再生状態を追跡するフラグ
	bool m_is_playing = false;
	// SEの音量
	float m_current_volume = 150.0f;

	// SEの種類読み取り専用（csvファイル）
	std::vector<std::vector<tnl::CsvCell>> m_csv_se_info;
	// SEの種類情報格納用
	std::vector<MusicSE::sMusicSE> m_ses_info;

	//-------------------------------------------------------------------------------//


	//----------------------------------メンバ関数----------------------------------//

	// SEパスの情報読み込み
	void LoadSEInfo();

public:

	// 再生
	// arg ... 該当する効果音のID
	// tips ... 効果音を再生するときに呼び出します
	void Play(int id);
	// 停止
	// arg ... 該当する効果音のID
	// tips ... 効果音を停止するときに呼び出します
	void Stop(int id);

	//-----------------------------------------------------------------------------//
};
