#pragma once
#include "../CinemaPlayer.h"


/////////////////////////////////////////////////////////////////////////////////////////
// 
// シネマプレイヤーのcsvファイルの読み込みクラス
// プレイヤーからは独立した内容のため、個別でクラス生成
//
/////////////////////////////////////////////////////////////////////////////////////////


class CinemaPlayerLoad
{

public:

	//--------------------------コンストラクタ、デストラクタ--------------------------//

	CinemaPlayerLoad();
	~CinemaPlayerLoad();

	//---------------------------------------------------------------------------------//

private:

	//-----------------------------------メンバ変数------------------------------------//

	// csvファイルの情報
	std::vector<std::vector<tnl::CsvCell>> m_csv_cinemaPlayer_parameters;

	// シネマプレイヤーの各種パラメータ
	std::vector<CinemaPlayer::sCinemaPlayerParameter> m_cinemaPlayer_parameters;

	//---------------------------------------------------------------------------------//


	//-----------------------------------メンバ関数------------------------------------//

	// シネマプレイヤーのパラメータ情報読み取り専用（csvファイル）
	// tips ... 初期化時に一度だけ呼び出す
	void LoadCinemaPlayerParameter();

	//---------------------------------------------------------------------------------//

public:

	//----------------------------------Setter&Getter----------------------------------//

	// シネマプレイヤーのパラメータ情報取得
	const std::vector<CinemaPlayer::sCinemaPlayerParameter>& GetCinemaPlayerParameter() const
	{
		return m_cinemaPlayer_parameters;
	}

	//---------------------------------------------------------------------------------//
};
