#pragma once
#include "../dxlib_ext/dxlib_ext.h"
#include "MusicBGM.h"
#include "MusicSE.h"


/////////////////////////////////////////////////////////////////////////////////////////
// 
// 音楽関係のマネージャークラス（シングルトン）
//
/////////////////////////////////////////////////////////////////////////////////////////

class MusicManager
{

private:

    //---------------------------コンストラクタ、デストラクタ---------------------------//

    MusicManager() {}

    //---------------------------------------------------------------------------------//


    //-----------------------------------メンバ関数-----------------------------------//

    // BGMの読み込み用
    std::unique_ptr<MusicBGM> m_bgm;
    // 効果音の読み込み用
    std::map<std::string, std::unique_ptr<MusicSE>> m_se;

    //--------------------------------------------------------------------------------//

public:

    //-----------------------------シングルトン用関数--------------------------------//

    // 静的変数としてシングルトンインスタンスを作成
    static MusicManager& GetInstance()
    {
        static MusicManager instance;
        return instance;
    }

    //------------------------------------------------------------------------------//


    //----------------------------------メンバ関数----------------------------------//

    // BGMの読み込み
    // arg ... 再生したいBGMのパス
    // tips ... BGMを設定する時に呼び出します
    // ex ... 	MusicManager::GetInstance().LoadBGM("music/title.mp3");
    void LoadBGM(const std::string& path);

    // 効果音の読み込み
    // arg1 ... 効果音のキー
    // arg2 ... 再生したい効果音のパス
    // tips ... 効果音を設定する時に呼び出します
    // ex ... 	MusicManager::GetInstance().LoadSE("jump", "se/jump.mp3");
    void LoadSE(const std::string& key, const std::string& path);

    // BGMの再生
    // tips ... BGMをループ再生するときに呼び出します
    void PlayBGM();
    // BGMの停止
    // tips ... BGMを停止するときに呼び出します
    void StopBGM();

    // 効果音の再生
    // arg ... 再生したい効果音のキー
    // tips ... 効果音を再生するときに呼び出します
    void PlaySE(const std::string& key);
    // 効果音の停止
    // arg ... 停止したい効果音のキー
    // tips ... 効果音を停止するときに呼び出します
    void StopSE(const std::string& key);

    //------------------------------------------------------------------------------//
};
