#pragma once
#include "../dxlib_ext/dxlib_ext.h"


/////////////////////////////////////////////////////////////////////////////////////////
// 
// BGMクラス（再生と停止）
//
/////////////////////////////////////////////////////////////////////////////////////////

class Mediator;

class MusicBGM
{

public:

	struct sMusicBGM
	{
		int s_id;
		int s_bgm_hdl = 0;
	};

	//--------------------------コンストラクタ、デストラクタ--------------------------//

	MusicBGM();

	~MusicBGM();

	//-------------------------------------------------------------------------------//

		// BGMの種類読み取り専用（csvファイル）
	std::vector<std::vector<tnl::CsvCell>> m_csv_bgm_info;
	// BGMの種類情報格納用
	std::vector<MusicBGM::sMusicBGM> m_bgms_info;

	// BGMパスの情報読み込み
	void LoadBGMInfo();

public:

	//----------------------------------メンバ関数----------------------------------//

	// BGMの再生
	// tips ... BGMをループ再生するときに呼び出します
	void Play();

	// BGMの停止
	// tips ... BGMを停止するときに呼び出します
	void Stop();

	//-----------------------------------------------------------------------------//
};
