#pragma once
#include "../dxlib_ext/dxlib_ext.h"


/////////////////////////////////////////////////////////////////////////////////////////
// 
// SEクラス（再生と停止）
//
/////////////////////////////////////////////////////////////////////////////////////////


class MusicSE
{

public:

	struct sMusicSE
	{
		int s_id;
		int s_se_hdl = 0;
	};

	
	//--------------------------コンストラクタ、デストラクタ--------------------------//

	MusicSE();

	~MusicSE();

	//-------------------------------------------------------------------------------//
	
	// SEの種類読み取り専用（csvファイル）
	std::vector<std::vector<tnl::CsvCell>> m_csv_se_info;
	// SEの種類情報格納用
	std::vector<MusicSE::sMusicSE> m_ses_info;

	// SEパスの情報読み込み
	void LoadSEInfo();

public:

	//----------------------------------メンバ関数----------------------------------//

	// 再生
	// tips ... 効果音を再生するときに呼び出します
	void Play();
	// 停止
	// tips ... 効果音を停止するときに呼び出します
	void Stop();

	//-----------------------------------------------------------------------------//
};
