#pragma once
#include "../Character.h"


class CinemaCameraTarget : public Character
{

public:

	//--------------------------コンストラクタ、デストラクタ--------------------------//

	CinemaCameraTarget();
	~CinemaCameraTarget() {}

	//---------------------------------------------------------------------------------//

private:

	//-----------------------------------メンバ変数------------------------------------//

	// メッシュのポインタ
	std::shared_ptr<dxe::Mesh> m_mesh = nullptr;

	//---------------------------------------------------------------------------------//

public:

	//-----------------------------------メンバ関数------------------------------------//

	void Draw(std::shared_ptr<dxe::Camera> camera) override;

	//---------------------------------------------------------------------------------//
};