#pragma once
#include "../Object.h"


///////////////////////////////////////////////////////////////////////////
//
// エンターキー誘導のイラスト更新描画処理を行うクラス
//　
///////////////////////////////////////////////////////////////////////////


class EnterGraph : public Object
{

public:

	//--------------------------コンストラクタ、デストラクタ---------------------------//

	EnterGraph();
	~EnterGraph();

	//---------------------------------------------------------------------------------//

private:

	//-----------------------------------メンバ変数------------------------------------//

	// エンター画像のハンドル 
	int m_enter_hdl = 0;

	// エンター画像の活性化フラグ
	bool m_is_active = false;

	// 点滅フラグ
	bool m_is_flash = false;

	// 経過時間
	float m_elasped_time = 0.0f;

	//---------------------------------------------------------------------------------//

public:

	//-----------------------------------メンバ関数------------------------------------//

	void Update(const float delta_time) override;
	// OP用
	void Draw(std::shared_ptr<dxe::Camera> camera) override;
	// ED用
	void Draw();

	//---------------------------------------------------------------------------------//


	//----------------------------------Setter&Getter----------------------------------//

	// 活性化フラグの設定
	void SetIsActive(bool is_active){ m_is_active = is_active; }

	//---------------------------------------------------------------------------------//
};